Tekla.Structures.Plugins.PropertyPane.PluginPropertyCreator.GetSingleProperty(Tekla.Structures.Plugins.PropertyPane.Single,System.String,System.String,System.String)
Create single property based on type.
type: The type of the property.
name: The name of the property.
label: The label of the property.
tooltip: The label of the property.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyCreator.GetWeldProperty(Tekla.Structures.Plugins.PropertyPane.WeldEnum,System.String,System.String,System.String,System.String)
Create weld properties based on type.
type: The type of the property.
leftName: The name of the possible left side property.
rightName: The name of the possible right side property.
label: The label of the property.
tooltip: The label of the property.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyCreator.GetDualProperty(Tekla.Structures.Plugins.PropertyPane.Dual,System.String,System.String,System.String,System.String)
Create dual properties based on type
type: The type of the property.
firstPropertyName: The name of the first property.
secondPropertyName: The name of the second property.
label: The label of the property.
tooltip: The label of the property.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyCreator.GetDropDownProperty(System.Collections.Generic.IEnumerable{System.String},System.String,System.String,System.String)
Create drop down property based on given values. Selected value is stored as integer.
values: The visible values of the property.
name: The name of the property.
label: The label of the property.
tooltip: The label of the property.